
Функция Сохранить() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Жанры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Жанры КАК Жанры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Страны.Ссылка
	|ИЗ
	|	Справочник.Страны КАК Страны
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Кино.Ссылка
	|ИЗ
	|	Справочник.Кино КАК Кино");
	Таб = Запрос.Выполнить().Выгрузить();
	МассивСправочниов = Новый Массив;
	Для каждого стр из Таб Цикл
		МассивСправочниов.Добавить(стр.Ссылка.ПолучитьОбъект());
	КонецЦикла;	
	
	Данные = Новый структура();
    Данные.Вставить("kinopoisk_unofficial_api_token",Константы.kinopoisk_unofficial_api_token.Получить());
	Данные.Вставить("ИспользуетсяЗаполнениеИзКинопоискаПоАПИ",Константы.ИспользуетсяЗаполнениеИзКинопоискаПоАПИ.Получить());
	Данные.Вставить("СтильОформления",Константы.СтильОформления.Получить());	
	Данные.Вставить("Справочники",МассивСправочниов);	
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Данные, НазначениеТипаXML.Явное);
	Текст =  ЗаписьJSON.Закрыть();
	
	Возврат Текст
	
КонецФункции

Процедура Восстановить(Текст, Лог = "") Экспорт
	
	УдалитьДанныеСправочников();
	
	ЧтениеJson = Новый ЧтениеJson;
	ЧтениеJson.УстановитьСтроку(Текст);
	Данные = СериализаторXDTO.ПрочитатьJSON(ЧтениеJson);
	Если ТипЗНЧ(Данные) = Тип("Массив") Тогда // Оставлено для совместимости с первыми версиями приложения	
		Для каждого стр из Данные Цикл
			стр.Записать();
		КонецЦикла;
	ИначеЕсли ТипЗНЧ(Данные) = Тип("Структура") Тогда	
		Константы.kinopoisk_unofficial_api_token.Установить(Данные.kinopoisk_unofficial_api_token);
		Константы.ИспользуетсяЗаполнениеИзКинопоискаПоАПИ.Установить(Данные.ИспользуетсяЗаполнениеИзКинопоискаПоАПИ);
		Константы.СтильОформления.Установить(Данные.СтильОформления);
		
		Для каждого стр из Данные.Справочники Цикл
			стр.Записать();
		КонецЦикла;
	КонецЕсли;
	ЧтениеJson.Закрыть();
	
КонецПроцедуры

Процедура УдалитьДанныеСправочников()
	
	Выборка = Справочники.Жанры.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла; 
	
	Выборка = Справочники.Кино.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла; 
	
	Выборка = Справочники.Страны.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
КонецПроцедуры