
Процедура ОбновитьФильмНаСервере(Кино) Экспорт
	
	API_KEY = Константы.kinopoisk_unofficial_api_token.Получить();
	Если API_KEY = "" Тогда
		Сообщить("Ошибка. Ключ АПИ для подключения не заполнен.");
	КонецЕсли;	
	АдресСервера = "kinopoiskapiunofficial.tech";
	api = "api/v2.2/films/" + Кино.КодКинопоиск;
	HTTPЗапрос = Новый HTTPЗапрос;                                                               
	HTTPЗапрос.АдресРесурса = api;
	HTTPЗапрос.Заголовки.Вставить("X-API-KEY", API_KEY);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	
	ОшибкаСообщение = "";
	Ошибка = Ложь;	
	Попытка 
		ОтветHTTP = Соединение.Получить(HTTPЗапрос)
	Исключение
		Попытка
			ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Исключение
			ОшибкаСообщение = ОписаниеОшибки() + Символы.ПС;
			Сообщить(ОшибкаСообщение);
			Ошибка = Истина;
		КонецПопытки;
	КонецПопытки;
	
	Если НЕ Ошибка Тогда
		Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();					
		Попытка
			ОбновитьДанныеФильма(Ответ,Кино);
		Исключение КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры 

Функция НайтиСоздатьСтрану(НазваниеСтраны)
	Страна = Справочники.Страны.НайтиПоНаименованию(НазваниеСтраны);
	Если страна.Пустая() Тогда
		об = Справочники.Страны.СоздатьЭлемент();
		Об.Наименование = НазваниеСтраны;
		об.Записать();
		Страна = об.Ссылка;
	КонецЕсли;
	Возврат Страна;
КонецФункции

Функция НайтиСоздатьЖанр(НазваниеЖанра)
	Жанр = Справочники.Жанры.НайтиПоНаименованию(НазваниеЖанра);
	Если Жанр.Пустая() Тогда
		об = Справочники.Жанры.СоздатьЭлемент();
		Об.Наименование = НазваниеЖанра;
		об.Записать();
		Жанр = об.Ссылка;
	КонецЕсли;
	Возврат Жанр;
КонецФункции

Процедура ОбновитьДанныеФильма(json,Кино)
	
	ЧтениеJson = Новый ЧтениеJson;
	ЧтениеJson.УстановитьСтроку(json);
	
	Данные = ПрочитатьJson(ЧтениеJson);
	
	Об = Кино;
	Об.Наименование = ?(Данные.nameRu = Неопределено или Данные.nameRu = "", Данные.nameOriginal,Данные.nameRu);
	Об.КодIMDB = Данные.imdbId;
	Об.Описание = Данные.description;
	Об.ГодВыпуска = Данные;	
	Об.ОригинальноеНазвание = Данные.nameOriginal;
	Об.ГодВыпуска = Формат(Данные.year, "ЧГ=100");
	Об.Страны.Очистить();
	Для каждого стрСтраны Из Данные.countries ЦИкл
		стр = Об.Страны.Добавить();
		стр.Страна = НайтиСоздатьСтрану(стрСтраны.country);	
	КонецЦикла;	
	
	Об.Жанры.Очистить();
	Для каждого стрСтраны Из Данные.genres ЦИкл
		стр = Об.Жанры.Добавить();
		стр.Жанр = НайтиСоздатьЖанр(стрСтраны.genre);	
	КонецЦикла;
	
	Если Данные.type = "FILM" ТОгда 	
		Об.Тип = Перечисления.ТипыКино.Фильм;
	ИначеЕсли Данные.type = "TV_SERIES" ТОгда
		Об.Тип = Перечисления.ТипыКино.Сериал; 
		Об.ГодОкончания = Формат(Данные.endYear, "ЧГ=100");
	КонецЕсли;		
	
КонецПроцедуры
