
Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
		
	ТекущийСтиль = Константы.СтильОформления.Получить();
	
	Если ТекущийСтиль = Перечисления.СтилиОформления.СтильОформленияЗеленый Тогда
		ТекущийСтиль = "СтильОформленияЗеленый";
	ИначеЕсли ТекущийСтиль = Перечисления.СтилиОформления.СтильОформленияРозовый Тогда
		ТекущийСтиль = "СтильОформленияРозовый";
	ИначеЕсли ТекущийСтиль = Перечисления.СтилиОформления.СтильОформленияСиний Тогда
		ТекущийСтиль = "СтильОформленияСиний";
		ИначеЕсли ТекущийСтиль = Перечисления.СтилиОформления.СтильОформленияСерый Тогда
		ТекущийСтиль = "СтильОформленияСерый";
	ИначеЕсли ТекущийСтиль = Перечисления.СтилиОформления.СтильОформленияТемноСерый Тогда
		ТекущийСтиль = "СтильОформленияТемноСерый";
		ИначеЕсли ТекущийСтиль = Перечисления.СтилиОформления.СтильОформленияБелый Тогда
		ТекущийСтиль = "СтильОформленияБелый";
	ИначеЕсли ТекущийСтиль = Перечисления.СтилиОформления.СтильОформленияЧерный Тогда
		ТекущийСтиль = "СтильОформленияЧерный";
	Иначе	
		ТекущийСтиль = "";
	КонецЕсли; 
	
	Если ТекущийСтиль = "" Тогда
		//ГлавныйСтиль = Новый Стиль;
	Иначе
		Попытка		
			ГлавныйСтиль = БиблиотекаСтилей[ТекущийСтиль];
		Исключение
		КонецПопытки;	 
	КонецЕсли;
	
	#Если НЕ МобильноеПриложениеКлиент Тогда	
	МасштабФорм = Константы.МасштабФорм.Получить();
	Если НЕ МасштабФорм = "" Тогда 
		НастройкиКлиентскогоПриложения = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения");
		Если Не ТипЗнч(НастройкиКлиентскогоПриложения) = Тип("НастройкиКлиентскогоПриложения") Тогда
			НастройкиКлиентскогоПриложения = Новый НастройкиКлиентскогоПриложения;
		КонецЕсли;
		НастройкиКлиентскогоПриложения.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения[МасштабФорм];
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", НастройкиКлиентскогоПриложения);
	КонецЕсли;
	#КонецЕсли

КонецПроцедуры
