
Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	ТекущийСтиль = ХранилищеОбщихНастроек.Загрузить(
	"СтильОформления",
	"Стиль");
	
	Если ТекущийСтиль = Неопределено Тогда
		//ГлавныйСтиль = Новый Стиль;
	Иначе
		Попытка
			ГлавныйСтиль = БиблиотекаСтилей[ТекущийСтиль];
		Исключение
			ПодробнаяИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтрШаблон("Не удалось установить главный стиль ""%1"" по причине:
			|%2",ТекущийСтиль,ПодробнаяИнформацияОбОшибке);			
			#Если НЕ МобильноеПриложениеСервер Тогда
				ЗаписьЖурналаРегистрации("Установка главного стиля приложения",УровеньЖурналаРегистрации.Предупреждение,,,ТекстОшибки); 
			#КонецЕсли
		КонецПопытки;	 
	КонецЕсли;
	
КонецПроцедуры
