
Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	
	ТекущийСтиль = Константы.СтильОформления.Получить();
	
	Если ТекущийСтиль = Перечисления.СтилиОформления.СтильОформленияЗеленый Тогда
		ТекущийСтиль = "СтильОформленияЗеленый";
	ИначеЕсли ТекущийСтиль = Перечисления.СтилиОформления.СтильОформленияРозовый Тогда
		ТекущийСтиль = "СтильОформленияРозовый";
	ИначеЕсли ТекущийСтиль = Перечисления.СтилиОформления.СтильОформленияСерый Тогда
		ТекущийСтиль = "СтильОформленияСерый";	
	ИначеЕсли ТекущийСтиль = Перечисления.СтилиОформления.СтильОформленияСиний Тогда
		ТекущийСтиль = "СтильОформленияСиний";
	ИначеЕсли ТекущийСтиль = Перечисления.СтилиОформления.СтильОформленияТемный Тогда
		ТекущийСтиль = "СтильОформленияТемный";
	Иначе	
		ТекущийСтиль = "";
	КонецЕсли; 
	
	Если ТекущийСтиль = "" Тогда
		//ГлавныйСтиль = Новый Стиль;
	Иначе
		Попытка
			
			ГлавныйСтиль = БиблиотекаСтилей[ТекущийСтиль];
		Исключение
			#Если НЕ МобильноеПриложениеСервер Тогда
				ПодробнаяИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ТекстОшибки = СтрШаблон("Не удалось установить главный стиль ""%1"" по причине:
				|%2",ТекущийСтиль,ПодробнаяИнформацияОбОшибке);					
				ЗаписьЖурналаРегистрации("Установка главного стиля приложения",УровеньЖурналаРегистрации.Предупреждение,,,ТекстОшибки); 
			#КонецЕсли
		КонецПопытки;	 
	КонецЕсли;
	
КонецПроцедуры
