
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)		
	СкрытьПросмотренные = Истина;
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры

&НаКлиенте
Процедура Жанры(Команда)
	ОткрытьФорму("Справочник.Жанры.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Страны(Команда)
	ОткрытьФорму("Справочник.Страны.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("ОбщаяФорма.Настройки");
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрДинамисческогоСписка()
	Список.Параметры.УстановитьЗначениеПараметра("СкрытьПросмотренные", СкрытьПросмотренные);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПросмотренныеПриИзменении(Элемент)
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры
