
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)		
	
	Если Константы.СкрыватьПросмотренныеСерии.Получить() Тогда
		ФильтрПросмотр = 2;
		Элементы.НеПросмотренные.Пометка = Истина;
	Иначе
		ФильтрПросмотр = 0; 
		Элементы.БезФильтра.Пометка = Истина;
	КонецЕсли;	
	
	УстановитьПараметрДинамисческогоСписка(); 
	
	Пароль = Константы.ПарольДляВхода.Получить();
	Если НЕ Пароль = "" Тогда
		ВходПоПаролю = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Жанры(Команда)
	ОткрытьФорму("Справочник.Жанры.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Страны(Команда)
	ОткрытьФорму("Справочник.Страны.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("ОбщаяФорма.Настройки");
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрДинамисческогоСписка()
	Список.Параметры.УстановитьЗначениеПараметра("ФильтрПросмотр", ФильтрПросмотр); 
	Список.Параметры.УстановитьЗначениеПараметра("Тип", Тип);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПросмотренныеПриИзменении(Элемент)
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ВходПоПаролю Тогда 
		ОткрытьФорму("ОбщаяФорма.ВходПоПаролю",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипОтборПриИзменении(Элемент)
	УстановитьПараметрДинамисческогоСписка();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(,ВыбраннаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Просмотренные(Команда)
	ФильтрПросмотр = 1;
	УстановитьПараметрДинамисческогоСписка();
	Элементы.Просмотренные.Пометка = Истина;
	Элементы.НеПросмотренные.Пометка = Ложь;
	Элементы.БезФильтра.Пометка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НеПросмотренные(Команда)
	ФильтрПросмотр = 2;
	УстановитьПараметрДинамисческогоСписка();
	Элементы.Просмотренные.Пометка = Ложь;
	Элементы.НеПросмотренные.Пометка = Истина;
	Элементы.БезФильтра.Пометка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура БезФильтра(Команда)
	ФильтрПросмотр = 0;
	УстановитьПараметрДинамисческогоСписка();
	Элементы.Просмотренные.Пометка = Ложь;
	Элементы.НеПросмотренные.Пометка = Ложь;
	Элементы.БезФильтра.Пометка = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЖанрыНажатие(Элемент)
	ОткрытьФорму("Справочник.Жанры.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СтраныНажатие(Элемент)
	ОткрытьФорму("Справочник.Страны.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиНажатие(Элемент)
	ОткрытьФорму("ОбщаяФорма.Настройки");
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	ТС = Элементы.Список.ТекущаяСтрока;
	Если НЕ ТС = Неопределено Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект,ТС), "Удалить """ + Строка(ТС) + """?", РежимДиалогаВопрос.ДаНет,,,"Удаление");	 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, Ссылка) Экспорт	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда		
		УдалитьСервер(Ссылка);
		Элементы.Список.Обновить();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УдалитьСервер(Ссылка) 
	ОБ = Ссылка.ПолучитьОбъект();
	ОБ.Удалить();	
КонецПроцедуры