&НаКлиенте
Процедура kinopoisk_unofficial_api_tokenПриИзменении(Элемент)
	УстановитьЗначениеКонстанты("kinopoisk_unofficial_api_token", kinopoisk_unofficial_api_token);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	kinopoisk_unofficial_api_token = Константы.kinopoisk_unofficial_api_token.Получить();
	Стиль = Константы.СтильОформления.Получить();
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеКонстанты(ИмяКонстанты, ЗначениеКонстанты)
	Константы[ИмяКонстанты].Установить(ЗначениеКонстанты);
КонецПроцедуры

&НаКлиенте
Процедура СтильПриИзменении(Элемент)
	УстановитьЗначениеКонстанты("СтильОформления", Стиль);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Для применения нужно перезапустить программу. Перезапустить?",
        РежимДиалогаВопрос.ДаНет,0, КодВозвратаДиалога.Да,);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
        ЗавершитьРаботуСистемы(Ложь, Истина);
    КонецЕсли;	
 
КонецПроцедуры