
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТипДанных") Тогда
		ТипДанных = Новый ОписаниеТипов("СправочникСсылка." + Параметры.ТипДанных);
		ЭтаФорма.Заголовок = Параметры.ТипДанных;
		СЗ.ТипЗначения = ТипДанных;
		СЗ.ЗагрузитьЗначения(Параметры.Данные);
	Иначе	
		Возврат
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТД = Элементы.СЗ.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	ВЗнач = ТД.Значение;
	Если ВвестиЗначение(ВЗнач, "", ТипДанных) Тогда
		ТД.Значение	= ВЗнач;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДобавитьСтроку(Команда)
	ВЗнач = Неопределено;
	ВыбранноеЗначение = Ждать ВвестиЗначениеАсинх(ВЗнач, "", ТипДанных);
	Если НЕ ВыбранноеЗначение = Неопределено Тогда
		Сз.Добавить(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ЭтаФорма.Закрыть(СЗ.ВыгрузитьЗначения());
КонецПроцедуры
