
&НаСервере
Функция ВходНаСервере()
	Если Константы.ПарольДляВхода.Получить() = Пароль Тогда
		Закрывать = Истина;
	КонецЕсли;
	Возврат Закрывать
КонецФункции

&НаКлиенте
Процедура Вход(Команда)
	Авторизация();
КонецПроцедуры

&НаКлиенте
Процедура Выход(Команда)
	ЗавершитьРаботуСистемы(Ложь,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если НЕ Закрывать Тогда
		СтандартнаяОбработка = Ложь;
		ЗавершитьРаботуСистемы(Ложь,Ложь);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	Авторизация();
КонецПроцедуры

&НаКлиенте
Процедура Авторизация()
	Если ВходНаСервере() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры